{
  "kickBingoParticipant": {
    "bingoNotFound": "Le bingo pour lequel vous tentez d'expulser un participant n'a pas été trouvé.",
    "bingoParticipantNotFound": "Le participant que vous tentez d'expulser n'a pas été trouvé.",
    "forbidden": "Vous n'êtes pas autorisé à expulser ce participant du bingo."
  },
  "searchBingoParticipants": {
    "bingoNotFound": "Le bingo pour lequel vous tentez de rechercher des participants n'a pas été trouvé."
  },
  "updateBingoParticipant": {
    "bingoNotFound": "Le bingo pour lequel vous tentez de mettre à jour un participant n'a pas été trouvé.",
    "bingoParticipantNotFound": "Le participant que vous tentez de mettre à jour n'a pas été trouvé.",
    "teamNotFound": "L'équipe que vous tentez d'assigner au participant n'a pas été trouvée.",
    "cannotSetOwnerRole": "Vous ne pouvez pas assigner le rôle de propriétaire à un participant. Vouliez-vous plutôt transférer la propriété du bingo?",
    "forbidden": "Vous n'êtes pas autorisé à mettre à jour ce participant du bingo."
  },
  "leaveBingo": {
    "bingoNotFound": "Le bingo que vous tentez de quitter n'a pas été trouvé.",
    "notParticipant": "Vous n'êtes pas un participant de ce bingo.",
    "ownerCannotLeave": "Vous ne pouvez pas quitter ce bingo car vous en êtes le propriétaire. Veuillez d'abord transférer la propriété à un autre participant.",
    "forbidden": "Vous n'êtes pas autorisé à quitter ce bingo."
  },
  "transferOwnership": {
    "bingoNotFound": "Le bingo dont vous tentez de transférer la propriété n'a pas été trouvé.",
    "notOwner": "Vous n'êtes pas le propriétaire de ce bingo.",
    "targetParticipantNotFound": "Le participant à qui vous tentez de transférer la propriété n'a pas été trouvé.",
    "targetNotParticipant": "L'utilisateur à qui vous tentez de transférer la propriété n'est pas un participant de ce bingo.",
    "forbidden": "Vous n'êtes pas autorisé à transférer la propriété de ce bingo."
  },
  "activity": {
    "kicked": {
      "title": "{requester} a expulsé {username} du bingo",
      "deletedTileCompletions": "Les cases complétées par {username} ont également été annulées pour son équipe."
    },
    "left": {
      "title": "{requester} a quitté le bingo"
    },
    "ownershipTransferred": {
      "title": "{requester} a transféré la propriété à {target}"
    },
    "updated": {
      "title": "{requester} a mis à jour la participation de {username}",
      "role": "{requester} a changé le role de {username} à {role}",
      "teamName": "{requester} a changé l'équipe de {username} à {teamName}"
    }
  }
}
